import React from 'react';

export const Symptom = ({ symtoms }: { symtoms: string }): JSX.Element => {
  switch (symtoms) {
    case 'เหนื่อย/อ่อนเพลีย':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">
            อาการที่ 1 เหนื่อย/อ่อนเพลีย
          </div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <ul className="list-inside list-disc">
            <li>นอนหลับพักผ่อนให้เพียงพอ</li>
            <li>ดื่มน้ำอย่างพอเหมาะ ไม่ให้ร่างกายขาดน้ำ</li>
            <li>ทำกิจกรรมเพื่อให้ผ่อนคลาย เช่น การเล่นโยคะ</li>
            <li>
              หากท่านดื่มแอลกอฮอล์หรือใช้สารเสพติด ควรหลีกเลี่ยงเครื่องดื่มแอลกอฮอล์
              งดสูบบุหรี่ และไม่ยุ่งเกี่ยวกับยาเสพติดทุกชนิด
            </li>
            <li>
              หมั่นออกกำลังกายอย่างสม่ำเสมอ
              และเลือกการออกกำลังกายที่เหมาะสมกับร่างกายของตนเอง
              ไม่ควรออกกำลังกายที่หนักเกินไป แต่หากท่าเพิ่งหายป่วยไม่นาน
              ยังไม่แนะนำให้ออกกำลังกายมากหรือเหนื่อยเกินไป
              ควรปรับให้เป็นการออกกำลังแบบเบาๆ เช่น เคยวิ่งอาจปรับเป็นเดินก่อน
              เพื่อให้ปอดทำงานไม่หนักจนเกินไปและร่างกายค่อยๆ
              ฟื้นตัวและปรับตัวกลับสู่สภาวะที่แข็งแรง
            </li>
            <li>
              รับประทานอาหารที่มีคุณค่าทางโภชนาการและรับประทานอย่างพอเหมาะ
              โดยไม่ควรข้ามมื้ออาหารโดยเฉพาะมื้อเช้า
            </li>
          </ul>
          <div className="text-left text-base font-medium">
            หากมีอาการอ่อนเพลียที่มีอาการต่อไปนี้ร่วมด้วย ควรไปพบแพทย์
          </div>
          <ul className="list-inside list-disc">
            <li>นอนหลับพักผ่อนให้เพียงพอ</li>
            <li>เจ็บหน้าอก</li>
            <li>หายใจหอบเหนื่อย</li>
            <li>หัวใจเต้นผิดจังหวะหรือเต้นเร็ว </li>
            <li>รู้สึกเหมือนจะเป็นลม</li>
            <li>ปวดท้องรุนแรง ปวดหลังหรือเชิงกราน</li>
          </ul>
        </div>
      );

    case 'ไข้':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">อาการที่ 2 ไข้</div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <ul className="list-inside list-disc">
            <li>พักผ่อนให้เพียงพอ</li>
            <li>ดื่มน้ำเพื่อช่วยให้อุณหภูมิร่างกายเย็นลง และป้องกันการเกิดภาวะขาดน้ำ</li>
            <li>
              อาบน้ำอุ่น หรือนำผ้าไปชุบน้ำอุ่นก่อนบิดหมาด ๆ วางบริเวณหน้าผากและข้อมือ
              และต้องไม่ใช้ผ้าชุบน้ำเย็นเพื่อเช็ดตัวลดไข้
            </li>
            <li>กินอาหารอ่อนที่ย่อยง่าย</li>
            <li>สวมเสื้อผ้าที่ระบายอากาศได้ดี</li>
            <li>
              รับประทานยาแก้ปวดและลดไข้ เช่น ยาพาราเซตามอล ยาไอบูโพรเฟน ยาแอสไพริน เป็นต้น
            </li>
          </ul>
          <div className="text-left text-base font-medium">
            หากมีอาการอ่อนเพลียที่มีอาการต่อไปนี้ร่วมด้วย ควรไปพบแพทย์
          </div>
          <ul className="list-inside list-disc">
            <li>
              เมื่อมีไข้สูง 38.9 องศาเซลเซียส ร่วมกับอาการปวดหัว คอแข็ง หายใจไม่อิ่ม
              ท้องเสีย อาเจียน เซื่องซึม กังวลว่าจะเกิดภาวะขาดน้ำ เนื่องจากไม่ดื่มน้ำ
              ไม่รับประทานอาหาร หรือมีอาการอื่น ๆ
            </li>
            <li>
              เมื่อมีไข้สูงเกิน 38.9 องศาเซลเซียสนานกว่า 3 วัน
              และอาการไม่ดีขึ้นหลังรับประทานยา
            </li>
            <li>เมื่อมีไข้ที่อุณหภูมิตั้งแต่ 39.4 องศาเซลเซียสขึ้นไป</li>
          </ul>
        </div>
      );

    case 'หนาวสั่น':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">อาการที่ 3 หนาวสั่น</div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <ul className="list-inside list-disc">
            <li>
              อาการรู้สึกหนาวสั่น สาเหตุอาจจะเกิดจากมีไข้ซึ่งทำให้หนาวสั่น
              เบื้องต้นควรให้ความอบอุ่นร่างกาย ดื่มน้ำมากๆ พักผ่อนให้เพียงพอ
              กินยาลดไข้และเช็ดตัวลดไข้หากรู้สึกครั่นเนื้อครั่นตัว
            </li>
            <li>
              หากไม่สามารถวัดไข้ได้ หรือวัดแล้วไม่มีไข้ แต่รู้สึกหนาวสั่นอยู่ตลอด
              ควรไปพบแพทย์เพื่อตรวจวัดอุณหภูมิกายที่โรงพยาบาลอีกครั้งว่าเกิน 37.7
              องศาที่จัดว่ามีไข้หรือไม่ ซึ่งถ้ามีไข้จริง ควรได้รับการตรวจร่างกาย
              ตรวจเลือดที่จำเป็น เพื่อหาสาเหตุที่แน่ชัดต่อไป
            </li>
          </ul>
        </div>
      );

    case 'หายใจลำบาก / หายใจมีหอบเหนื่อย':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">
            อาการที่ 4 หายใจลำบาก/หายใจมีหอบเหนื่อย
          </div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <ul className="list-inside list-disc">
            <li>
              ฝึกหายใจแบบห่อริมฝีปาก ช่วยควบคุมจังหวะการหายใจให้ช้าลง
              ทำให้สูดหายใจได้ลึกขึ้น ร่างกายสามารถรับออกซิเจนได้อย่างเต็มที่
              และช่วยปล่อยอากาศที่ปอดกักไว้ให้ออกมาอย่างช้า ๆ โดยให้หายใจเข้าทางจมูก
              จากนั้นห่อริมฝีปากแล้วหายใจออกโดยปล่อยลมหายใจออกทางปากช้า ๆ
              ซึ่งท่านสามารถหายใจแบบห่อริมฝีปากได้เสมอเมื่อรู้สึกว่าตนเองกำลังหายใจไม่สะดวก
            </li>
            <li>
              ฝึกหายใจด้วยท้อง
              ช่วยให้กล้ามเนื้อกระบังลมที่อยู่ระหว่างหน้าอกและช่องท้องใต้ปอดทำงานได้ดีขึ้นและช่วยให้หายใจสะดวกขึ้น
              โดยให้วางฝ่ามือข้างหนึ่งลงบนหน้าอก และวางฝ่ามืออีกข้างลงบนหน้าท้อง
              หน้าท้องจะป่องขึ้นขณะหายใจเข้าทางจมูก จากนั้นใช้ฝ่ามือกดลงบนหน้าท้องเบา ๆ
              ขณะหายใจออกเพื่อไล่อากาศ
              โดยสามารถหายใจด้วยวิธีนี้ร่วมกับการหายใจแบบห่อริมฝีปากได้
              เพื่อช่วยบรรเทาอาการหายใจไม่อิ่มให้ดีขึ้น
            </li>
            <li>
              อยู่ที่ที่อากาศถ่ายเทสะดวก
              ผลจากการวิจัยพบว่าอากาศที่เย็นสบายช่วยบรรเทาอาการหายใจไม่อิ่มให้ดีขึ้นได้
              ผู้ที่หายใจไม่อิ่มจึงควรอยู่ในสถานที่ที่มีความเย็นและอากาศถ่ายเทสะดวก
              เปิดพัดลม หรือเปิดแอร์เพิ่มความเย็นในอากาศ เป็นต้น
            </li>
            <li>
              นั่งเอนตัวไปด้านหน้า ทำได้โดยนั่งบนเก้าอี้ให้เท้าวางราบกับพื้น
              จากนั้นเอนตัวมาด้านหน้าแล้วค่อย ๆ ยกศอกขึ้นวางลงบนหัวเข่าหรือนั่งเท้าคาง
              ปล่อยตัวตามสบาย พยายามไม่เกร็งกล้ามเนื้อคอและไหล่
            </li>
            <li>
              จัดท่าที่ทำให้หายใจสะดวกมากขึ้น
              <ul className="list-outside list-decimal ml-4">
                <li>
                  นั่งเอนตัวไปด้านหน้าโดยมีโต๊ะค้ำ
                  เริ่มจากนั่งบนเก้าอี้โดยให้เท้าวางราบกับพื้น
                  โน้มตัวไปด้านหน้าแล้ววางแขนทั้ง 2 ข้างลงบนโต๊ะ จากนั้นเอนศีรษะลงบนแขน
                  หรืออาจใช้หมอนหนุนรองศีรษะแทนแขน
                </li>
                <li>
                  ยืนเท้าแขนกับโต๊ะ
                  ยืนใกล้กับโต๊ะหรือเครื่องใช้ที่มีความสูงระดับต่ำกว่าหัวไหล่
                  จากนั้นวางข้อศอกหรือมือทั้ง 2 ข้างลงบนโต๊ะ ไม่ต้องเกร็งคอ
                  ปล่อยไหล่ให้สบาย แล้วเอนศีรษะลงบนแขน
                </li>
                <li>
                  ยืนพิงผนัง ยืนกางขาออกให้กว้างประมาณหัวไหล่ เอนสะโพกให้ติดกับผนัง
                  ปล่อยแขนลงด้านหน้าตามธรรมชาติโดยให้มือทั้ง 2 ข้างวางลงบนต้นขา
                  แล้วเอนตัวมาด้านหน้าเล็กน้อยโดยไม่ต้องเกร็งไหล่
                </li>
                <li>
                  นอนในท่าที่ผ่อนคลาย บางรายอาจมีอาการหายใจไม่อิ่มขณะนอนหลับ
                  ทำให้มีปัญหาการนอนหลับ เช่น การตื่นขึ้นมาบ่อย ๆ ในระหว่างนอนหลับ
                  จึงอาจแก้ปัญหานี้ด้วยการนอนตะแคงหนีบหมอนไว้ระหว่างขาและเพิ่มหมอนหนุนศีรษะให้สูงขึ้น
                  โดยเหยียดหลังให้ตรง หรืออาจนอนหงายเพิ่มหมอนหนุนศีรษะให้สูงขึ้น
                  แล้ววางหมอนรองใต้ขาทั้ง 2 ข้างให้เข่างอขึ้น
                </li>
                <li>
                  นอนคว่ำหน้าท่า Awakening Prone หรือการนอนคว่ำตั้งแต่ยังรู้สึกตัว
                  เป็นเวลา 30 นาทีถึง 2 ชั่วโมง
                  จากนั้นให้พลิกตัวเปลี่ยนท่าตะแคงซ้ายหรือขวา
                  หรือนอนยกศีรษะขึ้นสูงเพื่อป้องกันแผลกดทับ
                </li>
              </ul>
            </li>
          </ul>
          <div className="text-left text-base font-medium">
            หากมีอาการหายใจลำบากร่วมกับอาการผิดปกติดังต่อไปนี้
            ควรรีบไปพบแพทย์เพื่อรับการตรวจรักษาทันที
          </div>
          <ul className="list-inside list-disc">
            <li>หายใจมีเสียงฟืดฟาด</li>
            <li>หายใจลำบากโดยเฉพาะเมื่อนอนราบ</li>
            <li>เท้าและข้อเท้าบวม</li>
            <li>มีไข้สูง ไอ หนาวสั่น</li>
          </ul>
        </div>
      );

    case 'ไอ':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">อาการที่ 5 ไอ</div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <ul className="list-inside list-disc">
            <li>ดื่มน้ำหรือน้ำอุ่นปริมาณมากเพื่อเจือจางเสมหะ ลดการระคายเคือง คอแห้ง</li>
            <li>ดื่มน้ำผึ้งผสมมะนาว จะช่วยบรรเทาอาการเจ็บคอไอมีเสมหะ</li>
            <li>
              เพิ่มความชื้นในอากาศ การนอนห้องแอร์หรืออยู่ห้องแอร์ทั้งวัน
              ยิ่งทำให้อาการไอกำเริบมากขึ้น
            </li>
            <li>นอนหลับพักผ่อนให้เพียงพอ</li>
            <li>หนุนหมอนสูงขณะนอนหลับ</li>
            <li>
              หลีกเลี่ยงในพื้นที่ที่มีฝุ่นละอองเยอะ ในสถานที่แออัดหรือที่มีมลพิษ
              เพราะอาจมีสารก่อการระคายเคืองทางจมูก
            </li>
            <li>อมยาอมช่วยลดการระคายเคืองในคอ</li>
          </ul>
          <div className="text-left text-base font-medium">
            หากยังมีอาการรุนแรงมากกว่า2-3สัปดาห์และไม่ดีขึ้น ควรไปพบแพทย์
          </div>
        </div>
      );

    case 'ใจสั่น':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">อาการที่ 6 ใจสั่น</div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <ul className="list-inside list-disc">
            <li>งดดื่มเครื่องดื่มแอลกอฮอล์หรือคาเฟอีน เช่น กาแฟ</li>
            <li>ไม่สูบบุหรี่</li>
            <li>ผ่อนคลายความเครียดความวิตกกังวล</li>
            <li>พักผ่อนให้เพียงพอ ป้องกันไม่ให้ร่างกายอ่อนเพลีย</li>
          </ul>
          <div className="text-left text-base font-medium">
            หากมีอาการรุนแรงควรพบแพทย์ เช่น หน้ามืด เป็นลมหมดสติ เจ็บแน่นหน้าอก
            เหนื่อยหอบมากกว่าปกติ
          </div>
        </div>
      );

    case 'หัวใจเต้นเร็ว (มากกว่า 100 ครั้ง/นาที)':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">
            อาการที่ 7 หัวใจเต้นเร็ว
          </div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <ul className="list-inside list-disc">
            <li>
              การใช้ผ้าเย็นเช็ดหน้า มีผลต่อการกระตุ้นเส้นประสาทเวกัส
              ซึ่งช่วยในการควบคุมอัตราการเต้นของหัวใจ
            </li>
            <li>การนวดเส้นเลือดแดงบริเวณตรงคอ นวดเบาๆเพื่อกระตุ้นเส้นประสาทใกล้เคียง</li>
            <li>หายใจเข้าลึกๆ สูดหายใจให้เต็มปอด</li>
          </ul>
          <div className="text-left text-base font-medium">
            หากมีอาการรุนแรงควรพบแพทย์ เช่น หัวใจเต้นเร็วมากกว่า 100ครั้ง/นาที
            มีอาการนานหลายนาที หน้ามืด หมดสติ หายใจลำบาก
          </div>
        </div>
      );

    case 'เจ็บหน้าอก':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">อาการที่ 8 เจ็บหน้าอก</div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <ul className="list-inside list-disc">
            <li>เจ็บหน้าอก</li>
            <li>ปลอบให้ผู้ป่วยคลายความวิตกกังวล</li>
            <li>หากทำกิจกรรมใดๆอยู่ควรหยุดทันที</li>
            <li>ให้หายใจเข้าลึก ตั้งสติแล้วผ่อนลมหายใจแบบเป่าลมออกทางปากช้าๆ</li>
            <li>ดื่มน้ำให้เพียงพอ</li>
          </ul>
          <div className="text-left text-base font-medium">
            หากผ่านไป 20 นาที อาการยังไม่หายหรือมีอาการรุนแรงเช่น รู้สึกหอบเหนื่อย
            หายใจสั้น คลื่นไส้ หน้ามืด จุกแน่นหรือแสบบริเวณลิ้นปี่ ให้รีบไปพบแพทย์ทันที
          </div>
        </div>
      );

    case 'จมูกไม่ได้กลิ่น/ลิ้นไม่รับรส':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">
            อาการที่ 9 จมูกไม่ได้กลิ่น/ลิ้นไม่รับรส
          </div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <ul className="list-inside list-disc">
            <li>
              การสูญเสียการรับกลิ่นจะค่อยๆ ดีขึ้นภายใน 1 เดือน และหายกลับมาเป็นปกติภายใน 2
              เดือน ส่วนอาการลิ้นไม่รับรสจะหายช้ากว่าเล็กน้อย
            </li>
            <li>
              ผู้ป่วยสามารถดูแลตนเองและฝึกการดมกลิ่น (Olfactory training)
              เพื่อช่วยให้อาการกลับมาดีขึ้นโดยเร็ว โดยการดมกลิ่นอ่อนๆ เช่น น้ำหอม สบู่
              เป็นต้น และไม่แนะนำให้ดมแอลกอฮอล์ แอมโมเนีย หรือของที่มีกลิ่นแรงๆ
              เนื่องจากกลิ่นดังกล่าวสามารถเข้าไปทำลายเซลล์เยื่อบุของระบบทางเดินหายใจ
              เพิ่มการบาดเจ็บของระบบประสาทของการรับรู้กลิ่น เป็นอันตรายต่อร่างกาย
            </li>
            <li>
              ส่วนการรักษาอาการลิ้นไม่รับรส
              ไม่แนะนำให้รับประทานอาหารที่มีรสจัดหรือเคี้ยวพริก
              เนื่องจากจะทำให้การฟื้นฟูของการรับรสแย่ลง อีกทั้งยังทำให้หายช้าลงอีกด้วย
            </li>
          </ul>
          <div className="text-left text-base font-medium">
            หลังหายจากเชื้อโควิด-19 แล้ว ผู้ป่วยอาจไม่สามารถหายกลับมาเป็นปกติได้เต็ม 100%
            อาจสูญเสียการรับรสหรือรับกลิ่นไปบ้าง แต่อาการดังกล่าวจะค่อยๆ ดีขึ้นเรื่อยๆ
            และกลับมาเป็นปกติในที่สุด
          </div>
        </div>
      );

    case 'ปวดศีรษะ':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">อาการที่ 10 ปวดศีรษะ</div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <ul className="list-inside list-disc">
            <li>อาการหลังติดเชื้อโควิด จะยังผิดปกติยาวนานกว่า 4-12 สัปดาห์</li>
            <li>
              ผู้ป่วยต้องแยกอาการปวดศีรษะที่เกิดจากการได้รับเชื้อ COVID-19
              กับการปวดศีรษะด้วยสาเหตุอื่นได้ด้วยการสังเกตอาการที่เกิดร่วมด้วยโดยผู้ที่ติดเชื้อ
              COVID-19 นอกจากจะมีอาการปวดศีรษะแล้ว จะมีอาการเวียนศีรษะ ปวดเมื่อย
            </li>
          </ul>
          <div className="text-left text-base font-medium">
            หากมีอาการรุนแรง ดังนี้ ควรพบแพทย์
          </div>
          <ul className="list-inside list-disc">
            <li>ปวดศีรษะเฉียบพลัน และรุนแรงขึ้นมาทันที</li>
            <li>ปวดศีรษะมากขึ้นเรื่อย ๆ ปวดขึ้นทุกวัน ทานยาแก้ปวดแล้วก็ไม่ดีขึ้น</li>
            <li>ปวดมากจนไม่สามารถนอนหลับได้ หรือปวดมากจนตื่นกลางดึก</li>
            <li>
              มีอาการผิดปกติอื่น ๆ ร่วมด้วย เช่น ไข้ ตามัว เห็นภาพซ้อน ชาแขนขา
              แขนขาอ่อนแรง คลื่นไส้อาเจียนรุนแรง
            </li>
          </ul>
        </div>
      );

    case 'เวียนศีรษะ':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">อาการที่ 11 เวียนศีรษะ</div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <ul className="list-inside list-disc">
            <li>
              อาการหลังติดเชื้อโควิด จะยังผิดปกติยาวนานกว่า 4-12 สัปดาห์
              หากผู้ป่วยมีอาการหน้ามืด เวียนศีรษะ ให้นั่งพักหรือนอนราบ
              ในลักษณะที่ศีรษะยกขึ้นสูงเล็กน้อย
            </li>
          </ul>
          <div className="text-left text-base font-medium">
            หากเกิดอาการบ่อยๆควรพบแพทย์ เพื่อหาสาเหตุและแนวทางการรักษาที่เหมาะสม
          </div>
        </div>
      );

    case 'การเคลื่อนไหวผิดปกติ':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">
            อาการที่ 12 การเคลื่อนไหวผิดปกติ
          </div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <ul className="list-inside list-disc">
            <li>อาการหลังติดเชื้อโควิด จะยังมีอาการยาวนานกว่า 4-12 สัปดาห์</li>
          </ul>
          <div className="text-left text-base font-medium">
            หากผู้ป่วยมีอาการกล้ามเนื้ออ่อนแรง การเคลื่อนไหวร่างกายผิดปกติ เช่น กระตุก
            สั่น ไม่คล่องตัวเหมือนเดิม
            ให้ผู้ป่วยบริหารกล้ามเนื้อหรือออกกำลังกายกล้ามเนื้อและกระดูกเบาๆ
            ถ้าหากอาการไม่ดีขึ้น ควรปรึกษาแพทย์เพื่อวินิจฉัยภาวะแทรกซ้อน
            ตรวจหาสาเหตุและรักษา
          </div>
        </div>
      );

    case 'สมองล้า':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">
            อาการที่ 13 ภาวะสมองล้า (Brain Fog Syndrome)
          </div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <ul className="list-inside list-disc">
            <li>ภาวะสมองล้าจะดีขึ้นตามลำดับเมื่อเวลาผ่านไปประมาณ 2-4 สัปดาห์</li>
            <li>เมื่อใช้สมาร์ทโฟน แท็บเล็ต คอมพิวเตอร์ ควรพักสายตาทุกๆชั่วโมง</li>
            <li>พักผ่อนให้เพียงพอ</li>
            <li>ไม่เครียด</li>
            <li>
              การเลือกทานอาหารเสริมบำรุงสมอง เช่น น้ำมันปลา วิตามินทั้งเอ บี ซี และอี
              ย่อมช่วยเสริมความจำ ลดความอ่อนล้าของสมอง ลดความเครียด ปรับสมดุลอารมณ์
            </li>
          </ul>
          <div className="text-left text-base font-medium">
            หากมีอาการนานกว่า 4-12 สัปดาห์ร่วมกับการมีปัญหาด้านความจำ ไม่ค่อยมีสมาธิ
            คิดได้ช้า มีอาการนอนไม่หลับ ปวดศีรษะแบบเรื้อรัง หงุดหงิดง่าย
            และสายตาอ่อนเพลียมากขึ้น ควรมาพบแพทย์
          </div>
        </div>
      );

    case 'ความจำสั้น/สมาธิสั้น':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">
            อาการที่ 14 ความจำสั้น/สมาธิสั้น
          </div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <ul className="list-inside list-disc">
            <li>พักผ่อนให้เพียงพอ อย่างน้อยวันละ 6-8 ชั่วโมง</li>
            <li>
              ทานอาหารที่มีประโยชน์ เช่น วิตามินบี 12 พบได้ใน ไข่ เครื่องในสัตว์ นม
              เนื้อสัตว์อื่นๆ ที่มีไขมันต่ำ วิตามินอี พบได้ใน ไข่ จมูกข้าวสาลี
              ขนมปังโฮลวีต เมล็ดทานตะวัน เมล็ดมะม่วงหิมพานต์ กะหล่ำปลี ผักใบเขียว ผักโขม
              ถั่ว อัลมอนด์ อะโวคาโด ปวยเล้ง
            </li>
            <li>
              หมั่นออกกำลังกายเป็นประจำ
              โดยเฉพาะอย่างยิ่งผู้สูงอายุจะต้องระมัดระวังไม่ให้หักโหมจนเกินไป
              แต่เพราะแทนที่จะเกิดประโยชน์อาจทำให้เกิดโทษได้
            </li>
            <li>
              หากิจกรรมที่ทำให้ฝึกสมาธิและใช้งานสมอง เช่น เกมอ่านออกสี อ่านออกเสียง
              ตามสีที่เห็น ไม่อ่านตามคำ (เช่น เห็นสีเขียว ก็อ่าน สีเขียว)
            </li>
          </ul>
          <div className="text-left text-base font-medium">
            เมื่อสังเกตว่าตนเองเริ่มมีอาการหลง ๆ ลืม ๆ มากผิดปกติ สมาธิสั้น
            หรือมีอาการบ่งชี้อื่นๆ ที่น่าสงสัย
            และรู้สึกว่าการแก้ไขและปรับพฤติกรรมด้วยตัวเองไม่สามารถทำให้อาการดีขึ้น
            ควรไปปรึกษาแพทย์
          </div>
        </div>
      );

    case 'วิตกกังวล':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">อาการที่ 15 วิตกกังวล</div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <ul className="list-inside list-disc">
            <li>แนะนำให้พูดคุย ปรึกษา และหาคนรับฟัง</li>
            <li>
              จำกัดปริมาณการดื่มคาเฟอีน
              การบริโภคเครื่องดื่มที่มีคาเฟอีนในปริมาณมากหรือต่อเนื่องเป็นเวลานาน
              อาจกระตุ้นให้เกิดโรควิตกกังวล
            </li>
            <li>
              การฝึกการหายใจเพื่อคลายเครียด โดยหายใจเข้าลึกๆพร้อมนับ 1 ถึง 4
              เป็นจังหวะช้าๆ จะรู้สึกว่าท้องพองออก จากนั้นจึงค่อยๆผ่อนลมหายใจออก โดยนับ 1
              ถึง 8 ไล่ลมหายใจและความเครียดออกมาพร้อมกัน
            </li>
          </ul>
          <div className="text-left text-base font-medium">
            หากพบว่ามีอาการวิตกกังวลมากจนมีผลกระทบต่อการใช้ชีวิตประจำวัน
            หรือมีอาการกระวนกระวาย อ่อนเพลีย หงุดหงิด ปวดเมื่อยกล้ามเนื้อ ไม่มีสมาธิ
            มีปัญหาการนอนหลับ ควรไปพบแพทย์
            อาจได้รับการทำจิตบำบัดหรือการบำบัดโดยการปรับเปลี่ยนความคิดและพฤติกรรม
          </div>
        </div>
      );

    case 'ซึมเศร้า':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">อาการที่ 16 ซึมเศร้า</div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <div>สร้างเสริมกำลังใจ โดยใช้หลักการ ของ “อึด ฮึด สู้”</div>
          <ul className="list-inside list-disc">
            <li>อึด : I am รู้ว่าตนเองเป็นอย่างไร ผ่านวิกฤตอะไรมาบ้าง </li>
            <li>
              ฮึด : I have รู้ว่าตนเองมีศักยภาพอะไร สามารถค้นหาแหล่งข้อมูล
              เพื่อพัฒนาทักษะดูแลตัวเองต่อไป
            </li>
            <li>สู้ : I can สร้างส่ิงดีๆ ให้เกิดขึ้นได้</li>
          </ul>
          <div>สร้างเสริมกำลังใจ โดยใช้หลักการ ของ “อึด ฮึด สู้”</div>
          <a href="https://srithanya.go.th/files/pr/10072558/2Q_9Q_8Q_1.pdf">
            https://srithanya.go.th/files/pr/10072558/2Q_9Q_8Q_1.pdf
          </a>
          <div className="text-left text-base font-medium">
            หากท่านมีอาการของโรคซึมเศร้าตั้งแต่ระดับน้อย ถึง รุนแรง ควรไปพบจิตแพทย์
            หรือโทร 1323 สายด่วนสุขภาพจิต
          </div>
        </div>
      );

    case 'นอนไม่ค่อยหลับ':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">
            อาการที่ 17 นอนไม่ค่อยหลับ
          </div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <ul className="list-inside list-disc">
            <li>เข้านอนและตื่นให้ตรงเวลาเป็นประจำ</li>
            <li>หลีกเลี่ยงการรับข่าวสารที่ทำให้เกิดความวิตกกังวล ในช่วงก่อนนอน</li>
            <li>ทำกิจกรรมผ่อนคลาย เช่น เปิดไฟสลัว 1 ชั่วโมงก่อนนอน ฟังเพลง ทำสมาธิ</li>
            <li>
              หากเข้านอนแล้ว แต่นอนไม่หลับนานเกิน 30 นาที
              ให้ลุกออกจากเตียงแล้วนั่งผ่อนคลายที่ไฟสลัว
              เพื่อทำให้เกิดความง่วงจึงกลับไปนอนอีกครั้ง
            </li>
            <li>หลีกเลี่ยงการจ้องมองนาฬิกาในห้องนอน</li>
            <li>ออกกำลังกายอย่างสม่ำเสมอ</li>
          </ul>
          <div className="text-left text-base font-medium">
            ผู้ป่วยหรือผู้ที่มีภาวะเครียดจากโรคโควิด-19 ที่ปรับพฤติกรรมการนอนหลับแล้ว
            แต่ยังมีปัญหาการนอนไม่หลับ ไม่แนะนำให้ซื้อยารับประทานเอง
            แต่ควรปรึกษาแพทย์ด้านการนอนหลับ เพื่อเข้ารับการรักษาอย่างถูกวิธี
          </div>
        </div>
      );

    case 'ท้องเสียบ่อย (มากกว่า 3 ครั้ง/วัน)':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">อาการที่ 18 ท้องเสีย</div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <ul className="list-inside list-disc">
            <li>การรับประทานอาหารที่ปรุงสุก อาหารที่ปรุงร้อน และ ใช้ช้อนกลาง</li>
            <li>รับประทานอาหารไม่มีแมลงวันตอม</li>
            <li>ดื่มน้ำสะอาด</li>
            <li>ล้างมือก่อนรับประทานอาหาร และหลังจากถ่ายอุจจาระ</li>
          </ul>
          <div className="text-left text-base font-medium">
            ควรไปพบแพทย์เมื่อพบว่าเป็นอยู่นาน และเรื้อรังมีเลือดปนออกมากับอุจจาระ
            มีอาการอาเจียน ดื่มน้ำ หรือกินอาหารได้น้อยเป็นโรคเรื้อรังอยู่ เช่น โรคเบาหวาน,
            โรคเลือด, โรคไต, โรคตับ ,โรคหัวใจ เป็นต้น
            อาการท้องเสียเกิดจากกินยาตามใบสั่งแพทย์ที่มีอาการข้างเคียงทำให้ท้องเสีย
            อุจจาระเป็นน้ำปริมาณมาก หรือ มีอาการแสดงภาวะขาดน้ำ เช่น ปากแห้ง ตาโหล เพลียซึม
            ไข้สูงเป็นต้น
          </div>
        </div>
      );

    case 'คลื่นไส้/อาเจียน':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">
            อาการที่ 19 คลื่นไส้ อาเจียน
          </div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <ul className="list-inside list-disc">
            <li>
              รับประทานอาหารครั้งละน้อย ๆ แต่บ่อยครั้ง
              เพื่อให้มีอาหารอยู่ในกระเพาะตลอดเวลา เนื่องจากอาการคลื่นไส้
              มักจะเกิดได้ง่ายเมื่อท้องว่าง
            </li>
            <li>เลือกอาหารที่ย่อยง่าย เช่น แกงจืด ขนมปังกรอบ</li>
            <li>พักผ่อนหลังรับประทานอาหาร</li>
            <li>มีการผ่อนคลายหลังรับประทานอาหาร เช่น ฟังเพลง ดูภาพยนตร์</li>
            <li>
              เมื่อรับประทานอาหารแล้วควรอยู่ในท่าศีรษะสูงและให้อยู่ในท่านี้อย่างน้อยครึ่งชั่วโมง
              ไม่ควรนอนราบทันทีหลังจากรับประทานอาหารเสร็จ
            </li>
            <li>รับประทานอาหารให้ตรงเวลา ไม่ควรทานเมื่อรู้สึกหิว</li>
            <li>เลือกสวมใส่เสื้อผ้าที่หลวม ๆ ไม่คับจนเกินไป</li>
            <li>
              ควรทำความสะอาดปากทุกครั้งภายหลังจากที่มีการอาเจียน
              หรือภายหลังจากรับประทานอาหาร
            </li>
            <li>
              ถ้าไม่มีแผลในช่องปาก การดื่มน้ำส้ม หรือน้ำมะนาวอาจช่วยบรรเทาอาการคลื่นไส้ได้
            </li>
            <li>หลีกเลี่ยงบริเวณที่มีควันหรือกลิ่นรุนแรง เช่น ในครัว</li>
            <li>
              หลีกเลี่ยงอาหารที่มีรสหวาน อาหารประเภททอด หรืออาหารที่มีไขมันสูง
              เพราะจะทำให้เกิดอาการคลื่นไส้ อาเจียน
            </li>
            <li>รับประทานอาหารช้า ๆ เคี้ยวให้ละเอียด เพื่อง่ายต่อการดูดซึม</li>
            <li>
              รับประทานขนมปังกรอบเค็ม ขนมปังปิ้งในช่วงเช้า จะช่วยบรรเทาอาการคลื่นไส้ได้
            </li>
            <li>
              ดูแลตนเองไม่ให้ท้องผูก เพราะอาการท้องผูกทำให้เกิดอาการคลื่นไส้อาเจียนได้
            </li>
          </ul>
          <div className="text-left text-base font-medium">
            หากอาการคลื่นไส้อาเจียนไม่ดีขึ้น ควรปรึกษาแพทย์
          </div>
        </div>
      );

    case 'ปวดท้อง':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">อาการที่ 20 ปวดท้อง</div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <ul className="list-inside list-disc">
            <li>ดื่มน้ำให้มากพอในแต่ละวัน</li>
            <li>ออกกำลังกายอย่างสม่ำเสมอ</li>
            <li>รับประทานอาหารมื้อละน้อย ๆ แต่รับประทานบ่อยขึ้น</li>
            <li>ลดอาหารที่จะทำให้เกิดแก๊สในกระเพาะ</li>
            <li>
              รับประทานอาหารให้ได้สารอาหารครบสัดส่วนและอุดมด้วยเส้นใยอาหารในแต่ละมื้อ
              โดยเลือกรับประทานผักและผลไม้ที่หลากหลายอย่างน้อยวันละ 5 ส่วน
              เพื่อให้ลำไส้มีสุขภาพดี และยังช่วยลดความเสี่ยงต่อการเกิดท้องผูก
              โรคถุงผนังลำไส้ใหญ่ รวมถึงโรคมะเร็งลำไส้ได้ดี
            </li>
          </ul>
          <div className="text-left text-base font-medium">ควรไปพบแพทย์</div>
        </div>
      );

    case 'ผมร่วง':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">อาการที่ 21 ผมร่วง</div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <div>อาการผมร่วงสามารถแบ่งออกเป็น 2 กลุ่ม คือ</div>
          <ul className="list-outside list-decimal ml-4">
            <li>กลุ่มที่ผมร่วงระดับน้อย ซึ่งอาการมักจะดีขึ้นภายใน 1 เดือน</li>
            <li>
              กลุ่มที่มีผมร่วงทั่วศีรษะ (Telogen effluvium)
              มักจะเกิดในกลุ่มผู้ป่วยที่มีอาการเจ็บป่วยรุนแรง
              โดยมีอาการผมร่วงมากกว่าปกติอย่างฉับพลัน ติดต่อกันต่อเนื่องประมาณ 3
              เดือนและจะมีอาการดีขึ้นในเวลา 6 เดือน
            </li>
          </ul>
          <div>
            มากกว่าปกติอย่างฉับพลัน ติดต่อกันต่อเนื่องประมาณ 3
            เดือนและจะมีอาการดีขึ้นในเวลา 6 เดือน{' '}
          </div>
          <ul className="list-inside list-disc">
            <li>
              รับประทานวิตามินเสริมร่วมได้เพื่อบรรเทาอาการ เช่น กลุ่มวิตามิน Biotin Zinc
              ได้แก่ ตับ ไข่ ขนมปัง ธัญพืช ถั่วเหลือง เป็นต้น
            </li>
            <li>
              แนะนำให้ผู้ป่วยลดความเครียด ทำจิตใจให้ผ่อนคลาย
              เพราะถ้าหากผู้ป่วยมีความเครียดมาก ก็จะยิ่งส่งผลให้ผมร่วงมากตามไปด้วย
            </li>
          </ul>
          <div className="text-left text-base font-medium">
            หากมีอาการรุนแรง เช่น ผมร่วงเป็นหย่อมกระจายอยู่ทั่วศีรษะ
            หรือบางรายมีเส้นขนที่ร่วงตามร่างกายร่วมด้วย เช่น ขนคิ้ว ขนตา ขนจมูก
            ควรไปพบแพทย์
          </div>
        </div>
      );

    case 'มีผื่นขึ้นตามร่างกาย':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">
            อาการที่ 22 ผื่นขึ้นตามร่างกาย
          </div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <div>
            อาการทางผิวหนังที่พบในผู้ป่วยโรคโควิด-19 สามารถแยกได้เป็น 2 ประเภท คือ
          </div>
          <ul className="list-outside list-decimal ml-4">
            <li>
              อาการผื่นผิวหนังจากโรคโควิด-19 โดยอาการบ่งชี้ เช่น ผู้ป่วยเป็นลมพิษ ผื่นแดง
              ตุ้มน้ำพอง หรือมีแผลแตกบริเวณผิวหนัง
            </li>
            <li>
              อาการผื่นผิวหนังจากการสวมหน้ากากอนามัยหรืออุปกรณ์ป้องกัน
              จำเป็นต้องสวมหน้ากากอนามัยตลอดเวลา
              ทำให้บางรายเป็นสิวหรือผื่นแดงบริเวณใบหน้าอันเนื่องมาจากการสวมหน้ากากอนามัยเป็นระยะเวลานาน
              หน้ากากอนามัยไม่สะอาด
              หรือบางรายเกิดจากการแพ้ส่วนประกอบบางชนิดของหน้ากากอนามัย
              ขณะที่บางรายมีอาการผื่นแดงตามมือจากการล้างมือบ่อยจนมือแห้งและระคายเคือง
            </li>
          </ul>
          <ul className="list-inside list-disc">
            <li>
              ควรหมั่นล้างมือเป็นประจำ และทาครีมบำรุงผิว(Moisturizer)
              เพื่อสร้างความชุ่มชื้นและลดการระคายเคืองของผิวหนัง
              ลดความเสี่ยงของอาการทางผิวหนังที่อาจเกิดขึ้นได้
              เเละหน้ากากอนามัยควรเปลี่ยนใหม่บ่อยๆ
              หรือหากเป็นหน้ากากผ้าควรหมั่นซักทำความสะอาดสม่ำเสมอ
            </li>
          </ul>
          <div className="text-left text-base font-medium">
            หากมีอาการรุนแรงมีการติดเชื้อบริเวณผิวหนัง โดยมีอาการแดง บวม ตึง เจ็บ แสบร้อน
            มีสะเก็ดสีเหลือง และขอบแผลชัด มีลักษณะคล้ายผิวที่โดนน้ำร้อนลวก
            หรืออาเจียนและมีไข้สูงร่วมด้วย ควรรีบมาพบแพทย์
          </div>
        </div>
      );

    case 'ผิวลอก':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">
            อาการที่ 23 มีผิวหนังลอก
          </div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <div>
            อาการทางผิวหนังที่พบในผู้ป่วยโรคโควิด-19 สามารถแยกได้เป็น 2 ประเภท คือ
          </div>
          <ul className="list-outside list-decimal ml-4">
            <li>
              อาการผื่นผิวหนังจากโรคโควิด-19 โดยอาการบ่งชี้ เช่น ผู้ป่วยเป็นลมพิษ ผื่นแดง
              ตุ้มน้ำพอง หรือมีแผลแตกบริเวณผิวหนัง
            </li>
            <li>
              อาการผื่นผิวหนังจากการสวมหน้ากากอนามัยหรืออุปกรณ์ป้องกัน
              จำเป็นต้องสวมหน้ากากอนามัยตลอดเวลา
              ทำให้บางรายเป็นสิวหรือผื่นแดงบริเวณใบหน้าอันเนื่องมาจากการสวมหน้ากากอนามัยเป็นระยะเวลานาน
              หน้ากากอนามัยไม่สะอาด
              หรือบางรายเกิดจากการแพ้ส่วนประกอบบางชนิดของหน้ากากอนามัย
              ขณะที่บางรายมีอาการผื่นแดงตามมือจากการล้างมือบ่อยจนมือแห้งและระคายเคือง
            </li>
          </ul>
          <ul className="list-inside list-disc">
            <li>
              ควรหมั่นล้างมือเป็นประจำ และทาครีมบำรุงผิว(Moisturizer)
              เพื่อสร้างความชุ่มชื้นและลดการระคายเคืองของผิวหนัง
              ลดความเสี่ยงของอาการทางผิวหนังที่อาจเกิดขึ้นได้
              เเละหน้ากากอนามัยควรเปลี่ยนใหม่บ่อยๆ
              หรือหากเป็นหน้ากากผ้าควรหมั่นซักทำความสะอาดสม่ำเสมอ
            </li>
          </ul>
          <div className="text-left text-base font-medium">
            หากมีอาการรุนแรงมีการติดเชื้อบริเวณผิวหนัง โดยมีอาการแดง บวม ตึง เจ็บ แสบร้อน
            มีสะเก็ดสีเหลือง และขอบแผลชัด มีลักษณะคล้ายผิวที่โดนน้ำร้อนลวก
            หรืออาเจียนและมีไข้สูงร่วมด้วย ควรรีบมาพบแพทย์
          </div>
        </div>
      );

    case 'กลืนลำบาก':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">อาการที่ 24 กลืนลำบาก</div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <ul className="list-inside list-disc">
            <li>นั่งหลังตรงกินหรือดื่ม ห้ามกินหรือดื่มขณะนอนเอนหลัง</li>
            <li>
              ให้ร่างกายอยู่ในท่าตั้งตรงซึ่งอาจจะเป็นท่านั่ง ยืน หรือเดิน อย่างน้อย 30
              นาที หลังรับประทานอาหาร
            </li>
            <li>
              ลองรับประทานอาหารที่หลากหลายเนื้อสัมผัส(หนืดมากหนืดน้อย)
              เเละสังเกตดูว่าอาหารชนิดไหนที่กลืนง่าย
              อาจเริ่มจากเลือกอาหารที่มีลักษณะนิ่มไปลื่นๆ หรือมีความชุ่มชื้น(อาหารอ่อน)
              หรือหากเป็นอาหารแข็งควรบดให้ละเอียด
            </li>
            <li>มีสมาธิในขณะรับประทานอาหารหรือดื่ม พยายามรับประทานอาหารในที่เงียบสงบ</li>
            <li>
              ค่อยๆกิน เริ่มจากคำเล็กๆ จิบน้ำทีละนิดในระหว่างที่มีอาหารอยู่ในปาก
              จากนั้นเคี้ยวให้ละเอียดก่อนกลืน
            </li>
            <li>กลืนอาหารให้หมด ก่อนที่จะเริ่มกินหรือดื่มคำใหม่</li>
            <li>
              แบ่งอาหารเป็นมื้อเล็กๆ ทยอยรับประทานทั้งวัน
              หากรู้สึกเหนื่อยเมื่อรับประทานมื้อใหญ่
            </li>
            <li>
              หากไอหรือสำลักอาหาร หรือหายใจลำบากในขณะกินหรือดื่ม ควรพักหรือรอจนอาการดีขึ้น
            </li>
          </ul>
          <div className="text-left text-base font-medium">
            หากมีอาการรุนแรง เช่น มีการสำลักบ่อยๆ ควรพบแพทย์
            เพราะอาจจะทำให้อาหารหรือเครื่องดื่มลงไปหลอดลมได้เเละเข้าไปในปอดของผู้ป่วย
            ส่งผลให้เกิดปอดอักเสบหรือุดกั้นทางเดินหายใจได้
          </div>
        </div>
      );

    case 'สูญเสียการได้ยิน':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">
            อาการที่ 25 ได้ยินไม่ชัด
          </div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <ul className="list-inside list-disc">
            <li>
              ทดสอบการได้ยิน หากพบว่ามีความเสี่ยงต่อไปนี้ เช่น
              มีปัญหาในการได้ยินระหว่างการสนทนา ได้ยินเสียงดังในหูหรือหูอื้อบ่อยครั้ง
              ควรได้รับการทดสอบการได้ยินเป็นประจำ
            </li>
            <li>
              ตรวจสอบการใช้ยาที่อาจมีผลกระทบต่อการได้ยิน
              มียารักษาโรคจำนวนมากที่มีผลกระทบต่อการได้ยิน เช่น ยาปฏิชีวนะ และยาต้านมะเร็ง
              หรือยาแอสไพรินที่ใช้ในปริมาณมาก หากมีความจำเป็นต้องใช้ยาเพื่อรักษาโรค
              ควรปรึกษาแพทย์ถึงผลกระทบต่อการได้ยิน
              หรือให้แพทย์ตรวจสอบการได้ยินก่อนการรักษา
            </li>
          </ul>
          <div className="text-left text-base font-medium">
            หากมีหลายอาการร่วมกันดังนี้ ควรพบแพทย์
          </div>
          <ul className="list-inside list-disc">
            <li>
              ได้ยินเสียงพูดของผู้อื่นไม่ชัดเจนหรือได้ยินลำบากขึ้น
              ทำให้ไม่สามารถเข้าใจสิ่งที่ผู้อื่นพูด
              โดยเฉพาะเมื่ออยู่ในสถานการณ์ที่มีการสนทนากันเป็นกลุ่ม
            </li>
            <li>
              มักให้ผู้อื่นพูดซ้ำ พูดให้ดังขึ้น หรือพูดช้าลง
              เนื่องจากไม่สามารถฟังได้ชัดเจน
            </li>
            <li>
              ได้ยินเสียงต่าง ๆ ลำบากขึ้น เช่น
              ไม่ได้ยินเสียงเรียกเข้าโทรศัพท์หรือไม่ได้ยินเสียงออดประตู
            </li>
            <li>ไม่สามารถหาที่มาของแหล่งกำเนิดเสียงได้</li>
            <li>เวลาฟังเพลงหรือดูโทรทัศน์จะเปิดเสียงดังกว่าปกติ</li>
            <li>
              มักรู้สึกเครียดหรือเหนื่อยจากการที่ต้องตั้งใจฟังเสียงมากกว่าปกติ
              หรือไม่ชอบอยู่ในวงสนทนา
            </li>
            <li>
              มีอาการเสียงดังในหู (Tinnitus) ซึ่งเป็นอาการของหูอื้อ
              ได้ยินคล้ายเสียงแมงหวี่ เสียงผึ้ง
              โดยมักพบว่ามีความเกี่ยวข้องกับการสูญเสียการได้ยิน
            </li>
          </ul>
        </div>
      );

    case 'เจ็บหู':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">
            อาการที่ 26 ปัญหาเกี่ยวกับหู
          </div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <ul className="list-inside list-disc">
            <li>ตรวจวัดระดับการได้ยินเสียง (Audiometry) </li>
            <li>
              ตรวจวัดระดับเสียงสะท้อนจากหูชั้นในเมื่อปล่อยเสียงกระตุ้น Otoacoustic
              Emission (OAE)
            </li>
            <li>
              ตรวจวัดคลื่นจากประสาทหูและก้านสมองเมื่อปล่อยเสียงกระตุ้น Auditory Brain Stem
              Response (ABR)
            </li>
            <li>ตรวจดูการทำงานของหูชั้นกลาง (Tympanometry)</li>
          </ul>
          <div className="text-left text-base font-medium">
            หากมีอาการรุนแรง ควรพบแพทย์
          </div>
          <ul className="list-inside list-disc">
            <li>คัน ระคายเคืองในรูหูส่วนนอก</li>
            <li>ปวดหู หูอื้อ</li>
            <li>มีของเหลว เช่น หนอง เลือด ไหลออกจากหู</li>
            <li>
              ผิวหนังของรูหูส่วนนอกบวม แดงเฉพาะที่ อาจเห็นลักษณะหัวฝี หรือบวมทั้งหมด
            </li>
            <li>เวลาเคลื่อนไหวใบหู จะมีอาการเจ็บมาก</li>
          </ul>
        </div>
      );

    case 'ตามองเห็นไม่ชัด':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">
            อาการที่ 27 ปัญหาเกี่ยวกับการมองเห็น
          </div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <ul className="list-inside list-disc">
            <li>
              ควรเข้ารับตรวจประเมินความสามารถในการมองเห็นของดวงตา ได้แก่
              การตรวจวัดระดับการมองเห็น (visual acuity), การวัดลาสายตา (visual field),
              การวัดค่าสายตา(refraction)
            </li>
          </ul>
          <div className="text-left text-base font-medium">
            หากมีอาการรุนแรง ควรพบแพทย์
          </div>
          <ul className="list-inside list-disc">
            <li>ปวดศีรษะบ่อยๆ</li>
            <li>แสบตา คันตา น้ำตาไหล</li>
            <li>ปวดตา เจ็บตา ร่วมกับมีหรือไม่มีขี้ตา</li>
            <li>
              ตามัวลง ไม่ว่าจะเป็นเพราะเคยมองเห็นได้ดีกว่านี้
              หรือมองเห็นได้น้อยกว่าผู้อื่นในวัยเดียวกัน
            </li>
            <li>เห็นภาพบิดเบี้ยว อาจจะเห็นเส้นตรงเป็นโค้งหรือหงิกๆ งอๆ มักเป็นตาเดียว</li>
            <li>
              เห็นภาพขาดหายไป เช่น มองหน้าคนไม่เห็นลูกตา หรือมองภาพคล้ายๆ
              ใครเอาผ้าม่านมาปิดบางส่วน หรือเห็นภาพดำๆ ตรงกลาง
            </li>
            <li>มองเห็นวัตถุข้างหน้าเป็น 2 อัน หรือหลายอัน</li>
          </ul>
        </div>
      );

    case 'ปวดกล้ามเนื้อ':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">
            อาการที่ 28 ปวดกล้ามเนื้อ
          </div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <ul className="list-inside list-disc">
            <li>
              แนะนำให้นวดบริเวณที่ปวดด้วยความระมัดระวัง เช่น การนวดกดจุด การนวดคลึง
              คลายจุดด้วยการใช้นิ้วหัวแม่มือนวดคลึงตามจุดที่ปวดกล้ามเนื้อ
              และใช้ยานวดร่วมด้วย
            </li>
            <li>
              ถ้ามีอาการปวดบริเวณกล้ามเนื้อมากให้ทานยาแก้ปวด ยาคลายกล้ามเนื้อเบื้องต้น
              เช่น Paracetamol เพื่อลดอาการปวด
            </li>
          </ul>
          <div className="text-left text-base font-medium">
            หากมีอาการรุนแรง เช่น อาการกล้ามเนื้ออ่อนแรง มีผื่นแดง
            บวมขึ้นในบริเวณที่มีอาการปวดกล้ามเนื้อ ควรแนะนำให้ไปพบแพทย์ทันที
          </div>
        </div>
      );

    case 'ปวดตามข้อและกระดูก':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">
            อาการที่ 29 ปวดตามข้อและกระดูก
          </div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <ul className="list-inside list-disc">
            <li>
              ถ้ามีอาการปวดให้พักข้อที่ปวด เช่น อย่าเดินมาก ยืนมาก หรือเดินขึ้นลงบันได
            </li>
            <li>
              แนะนำท่าบริหารง่ายๆ คือ
              นอนหงายงอเข่านำข้อเท้าเข้าหาสะโพกให้มากที่สุดก่อนยืดให้สุดอีกครั้ง ทำ 5-10
              ครั้ง วันละ 2-3 รอบ และกระดกข้อเท้าขึ้นลงช้าๆในท่านอน
            </li>
          </ul>
          <div className="text-left text-base font-medium">
            หากมีอาการรุนแรงไม่ดีขึ้น เช่น ปวดบวมตามข้อ ควรแนะนำให้ไปพบแพทย์ทันที
          </div>
        </div>
      );

    case 'คอแข็ง':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">อาการที่ 30 คอแข็ง</div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <ul className="list-inside list-disc">
            <li>
              แนะนำให้ทำกายภาพบำบัด โดยใช้ความร้อน
              เน้นการยืดเหยียดกล้ามเนื้อและสร้างความแข็งแรง
              เพื่อให้กล้ามเนื้อที่เกร็งมีการคลายตัว
            </li>
          </ul>
          <div className="text-left text-base font-medium">
            หากมีอาการรุนแรง เช่น คอแข็งนานเกิน 2-3 วัน ควรแนะนำให้ไปพบแพทย์ทันที
          </div>
        </div>
      );

    case 'มีปฏิกิริยาการแพ้เพิ่มขึ้นในอาการแพ้ที่มีอยู่เดิม':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">
            อาการที่ 31 มีปฏิกิริยาการแพ้เพิ่มขึ้น
          </div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <ul className="list-inside list-disc">
            <li>รับประทานอาหารที่มีประโยชน์ให้ครบ 5 หมู่</li>
            <li>ออกกำลังกายเป็นประจำ นอนหลับพักผ่อนให้เพียงพอ</li>
            <li>
              รักษาสุขภาพจิตให้สดชื่นแจ่มใส ไม่เครียดจนเกินไปเพราะถ้ามีอาการเครียด เศร้า
              โกรธ หรือกังวล อาจทำให้อาการของโรคมากขึ้นได้
            </li>
            <li>
              เมื่อมีการติดเชื้อในระบบทางเดินหายใจ หรือบริเวณรอบ ๆ จมูก เช่น หวัด
              ไซนัสอักเสบ ฟันผุ คอ หรือต่อมทอนซิลอักเสบ ควรรีบไปหาแพทย์เพื่อรักษา
              การติดเชื้อดังกล่าวจะทำให้ภูมิต้านทานของร่างกายลดลง
              อาการของโรคอาจกำเริบขึ้นได้
            </li>
            <li>
              พยายามหลีกเลี่ยงอย่าให้สัมผัสกับสิ่งที่แพ้
              ไม่ควรเข้าไปใกล้บริเวณที่มีฝุ่นมาก หรือบริเวณที่กำลังก่อสร้าง
            </li>
            <li>
              ควรกำจัดหรือลดปริมาณของสารก่อภูมิแพ้ที่มีอยู่ในสิ่งแวดล้อมรอบตัวให้เหลือน้อยที่สุด
              โดยเฉพาะสิ่งแวดล้อมภายในบ้าน เช่น ทำความสะอาดบ้าน จัดห้องนอนให้โล่ง
            </li>
          </ul>
          <div className="text-left text-base font-medium">
            หากอาการไม่ดีขึ้น ควรพบแพทย์
            โดยแพทย์จะพิจารณาให้ยาบรรเทาอาการและการฉีดวัคซีนภูมิแพ้
          </div>
        </div>
      );

    case 'มีอาการแพ้ใหม่ๆ ที่ไม่เคยแพ้มาก่อน':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">
            อาการที่ 32 มีอาการแพ้ใหม่ๆ ที่ไม่เคยเป็นมาก่อน
          </div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <ul className="list-inside list-disc">
            <li>
              หลีกเลี่ยงสิ่งกระตุ้นที่ทำให้เกิดภูมิแพ้ที่พบได้บ่อย เช่น ฝุ่นละออง
              ควันรถยนต์ สารเคมีต่างๆ เกสรดอกไม้ เชื้อรา เชื้อไวรัส อาหารที่ผู้ป่วยแพ้ง่าย
              ไรฝุ่น เป็นต้น
            </li>
            <li>
              การนอนหลับพักผ่อน ไม่ควรเข้านอนดึกจนเกินไป
              เพื่อให้ระบบภูมิคุ้มกันของร่างกายมีการซ่อมแซมและฟื้นฟูปรับสมดุลได้อย่างเพียงพอ
            </li>
            <li>
              ควรออกกำลังกายอย่างสม่ำเสมอ ต่อเนื่องกันอย่างน้อยวันละ 30 นาที สัปดาห์ละ 3
              วัน เช่น วิ่ง เดินเร็ว ว่ายน้ำ ปั่นจักรยาน เป็นต้น
              เนื่องจากการออกกำลังกายจะทำให้ความไวของเยื่อบุจมูก/หลอดลมลดลง
              และทำให้มีภูมิต้านทานต่อหวัดอีกด้วย
            </li>
            <li>
              ใช้น้ำเกลือทำความสะอาดบริเวณโพรงจมูก ค่อยๆ
              สูดน้ำเกลือให้น้ำเกลือได้สัมผัสกับโพรงจมูก แล้วค่อยๆ หายใจออก
              ให้น้ำเกลือเกิดการผ่านเข้าออกในโพรงจมูก ใช้เวลาทำประมาณ 3 นาที
              หากสามารถทำต่อเนื่องได้ในทุกๆ วัน
              จะสามารถช่วยรักษาอาการภูมิแพ้จมูกที่เป็นอยู่ได้
            </li>
            <li>
              หลีกเลี่ยงอาหารที่ทำให้เกิดอาการแพ้ รับประทานอาหารที่มีประโยชน์ให้ครบ 5 หมู่
              รวมทั้งผักและผลไม้ รับประทานอาหารที่สะอาด ปรุงสุกใหม่เสมอ
            </li>
          </ul>
          <div className="text-left text-base font-medium">
            อาการที่บ่งบอกว่ามีปฏิกิริยาการแพ้ที่รุนแรง ควรรีบไปพบแพทย์ ได้แก่
          </div>
          <ul className="list-inside list-disc">
            <li>ผื่นแดงตามผิวหนัง ลมพิษ มีอาการคัน ผิวหนังแดงหรือซีด</li>
            <li>วิงเวียนศีรษะ หน้ามืดคล้ายจะเป็นลม</li>
            <li>คลื่นไส้ อาเจียน</li>
            <li>ปวดท้องหรือท้องเสีย</li>
            <li>ความดันโลหิตลดต่ำลง</li>
            <li>ลิ้น ปาก หรือคอบวม</li>
            <li>หายใจติดขัด</li>
            <li>อาจมีเสียงดังหวีด ๆ</li>
            <li>รู้สึกเหมือนมีสิ่งอุดตันในลำคอ กลืนลำบาก</li>
            <li>แน่นหน้าอก ใจสั่น</li>
            <li>ชีพจรอ่อน หัวใจเต้นเร็ว</li>
          </ul>
        </div>
      );

    case 'ผิวหนังเป็นเม็ดพุพอง (คล้ายอาการของโรคงูสวัด)':
      return (
        <div className="mb-4">
          <div className="text-left text-lg mb-4 font-medium">
            อาการที่ 33 ผิวหนังเป็นเม็ดผุพอง ( คล้ายอาการของโรคงูสวัด )
          </div>
          <div className="text-left text-base font-medium">คำแนะนำ</div>
          <ul className="list-inside list-disc">
            <li>
              ควรทำความสะอาดร่างกายอย่างสม่ำเสมอ บริเวณที่เป็นแผลใช้น้ำเกลือ
              ทำความสะอาดแผล ไม่แกะเกาผื่นแผล
              ไม่ควรใช้ยาพ่นหรือพอกยาเพราะจะทำให้ติดเชื้อได้ง่าย
            </li>
            <li>
              ควรหลีกเลี่ยงการใกล้ชิดกับผู้ป่วยที่เป็นโรคติดเชื้อ ไม่ไปในสถานที่แออัด
            </li>
            <li>
              หลีกเลี่ยงสิ่งที่ระคายเคืองต่อผิวหนังง่าย เช่น เสื้อผ้าที่รัด ความร้อน
            </li>
            <li>
              ออกกำลังกายสม่ำเสมอ พักผ่อนให้เพียงพอ รับประทานอาหารที่สุกสะอาด
              อาหารอ่อนย่อยง่ายรสไม่จัด ผลไม้ควรปอกเปลือกก่อนรับประทาน
              แต่ควรหลีกเลี่ยงการออกกำลังกายหนัก ๆ ไม่ใส่เสื้อผ้ารัดคับ
            </li>
            <li>
              การได้รับยากดภูมิต้านทาน อาจมีผลกระทบต่อโรคประจำตัวได้ เช่น โรคเบาหวาน
              ความดันโลหิตสูง ควรได้รับการรักษาควบคู่กันไป
              นอกจากนี้หากมีอาการปวดท้องอุจจาระดำ อาเจียนเป็นเลือด ควรแจ้งให้แพทย์ทราบ
            </li>
            <li>
              ผู้ที่มีแผลในปากควรงดอาหารรสจัด และงดรับประทานอาหารแข็ง เช่น ถั่ว ปลาแห้ง
              ของขบเคี้ยว เนื่องจากอาจกระตุ้นการ หลุดลอกของเยื่อบุในช่องปาก
            </li>
            <li>หลีกเลี่ยงแสงแดด และความเครียด </li>
            <li>
              ส่วนใหญ่แผลพุพองจะมีอาการที่ไม่รุนแรง ถ้าปล่อยทิ้งไว้ ดูแลรักษาไม่ดี
              หรือไม่รีบเข้ารับการรักษา สามารถทำให้เกิดภาวะแทรกซ้อนได้
            </li>
          </ul>
          <div className="text-left text-base font-medium">
            หากแผลมีการติดเชื้อ มีอาการแดง บวม ตึง เจ็บ แสบร้อนที่ผิวหนัง
            มีสะเก็ดสีเหลืองและขอบแผลชัด มีลักษณะคล้ายผิวที่โดนน้ำร้อนลวก
            หรืออาเจียนและมีไข้สูงร่วมด้วย ควรรีบมาพบแพทย์
          </div>
        </div>
      );

    default:
      return <></>;
  }
};
